# Pandas Grouper and Agg Functions Explained

In [3]:
import pandas as pd
df = pd.read_excel("data/sample-salesv3.xlsx")
df["date"] = pd.to_datetime(df['date'])
df.head()

,account number,name,sku,quantity,unit price,ext price,date
0,740150,Barton LLC,B1-20000,39,86.69,3380.91,2014-01-01 07:21:51
1,714466,Trantow-Barrows,S2-77896,-1,63.16,-63.16,2014-01-01 10:00:47
2,218895,Kulas Inc,B1-69924,23,90.70,2086.10,2014-01-01 13:24:58
3,307599,"Kassulke, Ondricka and Metz",S1-65481,41,21.05,863.05,2014-01-01 15:05:22
4,412290,Jerde-Hilpert,S2-34077,6,83.21,499.26,2014-01-01 23:26:55

#### Offset Aliases 
http://pandas.pydata.org/pandas-docs/stable/timeseries.html#offset-aliases

### “resample”方法

In [11]:
df.set_index('date').resample('M')['ext price'].sum()

date
2014-01-31    185361.66
2014-02-28    146211.62
2014-03-31    203921.38
2014-04-30    174574.11
2014-05-31    165418.55
2014-06-30    174089.33
2014-07-31    191662.11
2014-08-31    153778.59
2014-09-30    168443.17
2014-10-31    171495.32
2014-11-30    119961.22
2014-12-31    163867.26
Freq: M, Name: ext price, dtype: float64

In [16]:
df.set_index('date').groupby('name')["ext price"].resample("M").sum().head(20)

name                             date
Barton LLC                       2014-01-31     6177.57
                                 2014-02-28    12218.03
                                 2014-03-31     3513.53
                                 2014-04-30    11474.20
                                 2014-05-31    10220.17
                                 2014-06-30    10463.73
                                 2014-07-31     6750.48
                                 2014-08-31    17541.46
                                 2014-09-30    14053.61
                                 2014-10-31     9351.68
                                 2014-11-30     4901.14
                                 2014-12-31     2772.90
Cronin, Oberbrunner and Spencer  2014-01-31     1141.75
                                 2014-02-28    13976.26
                                 2014-03-31    11691.62
                                 2014-04-30     3685.44
                                 2014-05-31     6760.11
                                 2014-06-30     5379.67
                                 2014-07-31     6020.30
                                 2014-08-31     5399.58
Name: ext price, dtype: float64

### 用“Grouper”的方式来做

In [47]:
df.groupby(['name', pd.Grouper(key='date', freq='M')])['ext price'].sum().head(20)

name                             date
Barton LLC                       2014-01-31     6177.57
                                 2014-02-28    12218.03
                                 2014-03-31     3513.53
                                 2014-04-30    11474.20
                                 2014-05-31    10220.17
                                 2014-06-30    10463.73
                                 2014-07-31     6750.48
                                 2014-08-31    17541.46
                                 2014-09-30    14053.61
                                 2014-10-31     9351.68
                                 2014-11-30     4901.14
                                 2014-12-31     2772.90
Cronin, Oberbrunner and Spencer  2014-01-31     1141.75
                                 2014-02-28    13976.26
                                 2014-03-31    11691.62
                                 2014-04-30     3685.44
                                 2014-05-31     6760.11
                                 2014-06-30     5379.67
                                 2014-07-31     6020.30
                                 2014-08-31     5399.58
Name: ext price, dtype: float64

In [48]:
df.groupby(['name', pd.Grouper(key='date', freq='A')])['ext price'].sum()

name                             date
Barton LLC                       2014-12-31    109438.50
Cronin, Oberbrunner and Spencer  2014-12-31     89734.55
Frami, Hills and Schmidt         2014-12-31    103569.59
Fritsch, Russel and Anderson     2014-12-31    112214.71
Halvorson, Crona and Champlin    2014-12-31     70004.36
Herman LLC                       2014-12-31     82865.00
Jerde-Hilpert                    2014-12-31    112591.43
Kassulke, Ondricka and Metz      2014-12-31     86451.07
Keeling LLC                      2014-12-31    100934.30
Kiehn-Spinka                     2014-12-31     99608.77
Koepp Ltd                        2014-12-31    103660.54
Kuhn-Gusikowski                  2014-12-31     91094.28
Kulas Inc                        2014-12-31    137351.96
Pollich LLC                      2014-12-31     87347.18
Purdy-Kunde                      2014-12-31     77898.21
Sanford and Sons                 2014-12-31     98822.98
Stokes LLC                       2014-12-31     91535.92
Trantow-Barrows                  2014-12-31    123381.38
White-Trantow                    2014-12-31    135841.99
Will LLC                         2014-12-31    104437.60
Name: ext price, dtype: float64

In [56]:
df.groupby(['name', pd.Grouper(key='sku')])['ext price'].sum().head()

name        sku
Barton LLC  B1-04202    2433.20
            B1-05914     324.72
            B1-20000    7212.11
            B1-33087    4159.97
            B1-33364    4369.19
Name: ext price, dtype: float64

In [54]:
df.groupby(['name', pd.Grouper(key='sku', sort=True)])['ext price'].sum().head()

name        sku
Barton LLC  B1-04202    2433.20
            B1-05914     324.72
            B1-20000    7212.11
            B1-33087    4159.97
            B1-33364    4369.19
Name: ext price, dtype: float64

#### 重点看“freq”的变化

In [20]:
df.groupby(['name', pd.Grouper(key='date', freq='A')])['ext price'].sum()

name                             date
Barton LLC                       2014-12-31    109438.50
Cronin, Oberbrunner and Spencer  2014-12-31     89734.55
Frami, Hills and Schmidt         2014-12-31    103569.59
Fritsch, Russel and Anderson     2014-12-31    112214.71
Halvorson, Crona and Champlin    2014-12-31     70004.36
Herman LLC                       2014-12-31     82865.00
Jerde-Hilpert                    2014-12-31    112591.43
Kassulke, Ondricka and Metz      2014-12-31     86451.07
Keeling LLC                      2014-12-31    100934.30
Kiehn-Spinka                     2014-12-31     99608.77
Koepp Ltd                        2014-12-31    103660.54
Kuhn-Gusikowski                  2014-12-31     91094.28
Kulas Inc                        2014-12-31    137351.96
Pollich LLC                      2014-12-31     87347.18
Purdy-Kunde                      2014-12-31     77898.21
Sanford and Sons                 2014-12-31     98822.98
Stokes LLC                       2014-12-31     91535.92
Trantow-Barrows                  2014-12-31    123381.38
White-Trantow                    2014-12-31    135841.99
Will LLC                         2014-12-31    104437.60
Name: ext price, dtype: float64

In [24]:
df.groupby(['name', pd.Grouper(key='date', freq='A-OCT')])['ext price'].sum()

name                             date
Barton LLC                       2014-10-31    101764.46
                                 2015-10-31      7674.04
Cronin, Oberbrunner and Spencer  2014-10-31     76072.84
                                 2015-10-31     13661.71
Frami, Hills and Schmidt         2014-10-31     80098.76
                                 2015-10-31     23470.83
Fritsch, Russel and Anderson     2014-10-31     93635.99
                                 2015-10-31     18578.72
Halvorson, Crona and Champlin    2014-10-31     63086.66
                                 2015-10-31      6917.70
Herman LLC                       2014-10-31     73151.31
                                 2015-10-31      9713.69
Jerde-Hilpert                    2014-10-31     98521.05
                                 2015-10-31     14070.38
Kassulke, Ondricka and Metz      2014-10-31     73189.03
                                 2015-10-31     13262.04
Keeling LLC                      2014-10-31     77375.46
                                 2015-10-31     23558.84
Kiehn-Spinka                     2014-10-31     79202.84
                                 2015-10-31     20405.93
Koepp Ltd                        2014-10-31     86987.27
                                 2015-10-31     16673.27
Kuhn-Gusikowski                  2014-10-31     78936.54
                                 2015-10-31     12157.74
Kulas Inc                        2014-10-31    127096.24
                                 2015-10-31     10255.72
Pollich LLC                      2014-10-31     68655.21
                                 2015-10-31     18691.97
Purdy-Kunde                      2014-10-31     71470.42
                                 2015-10-31      6427.79
Sanford and Sons                 2014-10-31     89837.46
                                 2015-10-31      8985.52
Stokes LLC                       2014-10-31     79010.85
                                 2015-10-31     12525.07
Trantow-Barrows                  2014-10-31    106707.05
                                 2015-10-31     16674.33
White-Trantow                    2014-10-31    121490.45
                                 2015-10-31     14351.54
Will LLC                         2014-10-31     88665.95
                                 2015-10-31     15771.65
Name: ext price, dtype: float64

## “agg”的用法

In [28]:
df.head()

,account number,name,sku,quantity,unit price,ext price,date
0,740150,Barton LLC,B1-20000,39,86.69,3380.91,2014-01-01 07:21:51
1,714466,Trantow-Barrows,S2-77896,-1,63.16,-63.16,2014-01-01 10:00:47
2,218895,Kulas Inc,B1-69924,23,90.70,2086.10,2014-01-01 13:24:58
3,307599,"Kassulke, Ondricka and Metz",S1-65481,41,21.05,863.05,2014-01-01 15:05:22
4,412290,Jerde-Hilpert,S2-34077,6,83.21,499.26,2014-01-01 23:26:55

In [27]:
df[["ext price", "quantity"]].sum()

ext price    2018784.32
quantity       36463.00
dtype: float64

In [29]:
df["unit price"].mean()

55.00752666666659

In [30]:
df[["ext price", "quantity", "unit price"]].agg(['sum', 'mean'])

         ext price      quantity    unit price
sum   2.018784e+06  36463.000000  82511.290000
mean  1.345856e+03     24.308667     55.007527

In [31]:
df.agg({'ext price': ['sum', 'mean'], 'quantity': ['sum', 'mean'], 'unit price': ['mean']})

         ext price      quantity  unit price
mean  1.345856e+03     24.308667   55.007527
sum   2.018784e+06  36463.000000         NaN

In [32]:
get_max = lambda x: x.value_counts(dropna=False).index[0]

In [33]:
df.agg({'ext price': ['sum', 'mean'], 'quantity': ['sum', 'mean'], 'unit price': ['mean'], 'sku': [get_max]})

             ext price      quantity  unit price       sku
<lambda>           NaN           NaN         NaN  S2-77896
mean      1.345856e+03     24.308667   55.007527       NaN
sum       2.018784e+06  36463.000000         NaN       NaN

In [34]:
get_max.__name__ = "most frequent"

In [35]:
df.agg({'ext price': ['sum', 'mean'], 'quantity': ['sum', 'mean'], 'unit price': ['mean'], 'sku': [get_max]})

                  ext price      quantity  unit price       sku
mean           1.345856e+03     24.308667   55.007527       NaN
most frequent           NaN           NaN         NaN  S2-77896
sum            2.018784e+06  36463.000000         NaN       NaN

In [42]:
import collections
f = collections.OrderedDict([('ext price', ['sum', 'mean']),('sku', [get_max]),('quantity', [ 'sum','mean'])])
df.agg(f)

                  ext price       sku      quantity
mean           1.345856e+03       NaN     24.308667
most frequent           NaN  S2-77896           NaN
sum            2.018784e+06       NaN  36463.000000